# Bootcamp: Analista de Banco de Dados  - Desafio do Módulo 2

<img src="./xpe.png" align='left' alt="drawing" width="150" heigth="150"/>

<img src="./bd.jpg" align='center' alt="drawing" width="300" heigth="300"/>

## Objetivos de Ensino

### Exercitar os seguintes conceitos trabalhados no Módulo:

* **1. Modelo de dados relacional.**
* **2. Banco de dados relacional.**
* **3. Instruções da classe DDL para a criação de estruturas de dados.**
* **4. Instruções da classe DML para consultar, inserir, excluir e atualizar dados;**
* **5. Instruções da classe TCL para controlar transações;**
* **6. Instruções da classe DCL para conceder e revogar privilégios.**

## Enunciado:

**A XPE inaugurará, em breve, seu site de E-commerce para serviços
educacionais e necessita de uma aplicação que permita o cadastramento de
seus clientes e o controle dos serviços adquiridos por eles. A XPE trabalha
com vários fornecedores (parceiros), que oferecem diversos tipos de serviços,
como aulas particulares a distância, monitoria/tutoria/produção de conteúdo
para cursos rápidos, bootcamps, cursos de graduação, MBAs etc., bem como
consultoria para criação de conteúdo/produtos de ensino a distância. Um
mesmo fornecedor pode oferecer mais de um tipo de serviço. Quando um
cliente compra um serviço, é emitida uma nota de pedido relacionando todos
os serviços (produtos) que envolveram a transação e a forma de pagamento
selecionada pelo cliente.**
* **Para esse sistema, foi desenvolvido, inicialmente, o modelo de dados físico relacional a seguir:**

![img](./eer.png)

**A empresa lhe contratou como o(a) analista de banco de dados responsável
por implementar e gerenciar esse modelo de dados, construir as queries
demandadas pelos desenvolvedores e sanar as dúvidas da equipe do projeto
referentes à Linguagem SQL.**

<a name="ancora"></a>
### Os alunos deverão desempenhar as seguintes atividades:


* ## [Atividades.](#ancora0)
    * ### [Criar a conexão com o MySQL.](#ancora0.1)
    * ### [1-Gerar o script DDL para criar, no SQL Server, as respectivas estruturas de dados no banco BDecommerce.](#ancora1)
    * ### [2-Gerar o script DML para inserir dados fictícios em todas as tabelas do schema físico criado no item anterior.](#ancora2)
    
    * ### [3-Desenvolver uma query SQL para gerar uma lista única com os contatos(nome, endereço e telefone) de clientes e fornecedores, sem informações repetidas, ordenada alfabeticamente. Esse relatório deve conter as colunas com o label Nome da Pessoa, Endereço e Telefone.](#ancora3)
    * ### [4-Depois que a tabela  FORMA_PAGAMENTO já estava populada, a empresa solicitou a inclusão de mais uma coluna (IND_STATUS char(1) NOT NULL) para indicar se a forma de pagamento está disponível (‘D’) ou indisponível (‘I’). Desenvolva o script para as duas formas existentes para se incluir essa nova coluna sem ter que recriar a tabela, e considerando que todas as formas de pagamento atuais da tabela estão disponíveis.](#ancora4)
    * ### [5-A empresa solicitou que a coluna VLR_TOTAL_PEDIDO da tabela PEDIDO, que já se encontra populada, seja alterada para NOT NULL. Construa uma query DML com um SELECT para você executar previamente e verificar se o comando abaixo será concluído com sucesso ou não.](#ancora5)
            * ALTER TABLE PEDIDO
              ALTER COLUMN VLR_TOTAL_PEDIDO numeric (10,2) NOT NULL;
    
    * ### [6-Na consulta abaixo, criada por um desenvolvedor, ela deveria retornar 5 colunas, mas estão sendo retornadas 7 colunas. Foi solicitado que você corrija a query para apresentar as 5 colunas com os labels: COD_CLIENTE, NOME COMPLETO, CPF_CNPJ, DSC_ENDERECO_COBRANCA e AS CELULAR.](#ancora6)    
            *   SELECT COD_CLIENTE, NOM_CLIENTE, 'NOME COMPLETO',
                NUM_CPF_CNPJ CPF_CNPJ, DSC_ENDERECO_COBRANCA,
                NUM_TELEFONE, ‘CELULAR’
                FROM CLIENTE
                ORDER BY NOM_CLIENTE
                GO

    * ### [7-A empresa que te contratou solicitou que você explique o motivo pelo qual a query abaixo (para retornar os pedidos dos clientes) está dando erro de execução, e reescreva-a de forma que ela possa ser executada com sucesso.](#ancora7)
            *   SELECT C.NOM_CLIENTE AS "NOME DO CLIENTE", P.NUM_PEDIDO
                PEDIDO, P.DAT_PEDIDO AS "DATA DO PEDIDO",
                P.VLR_TOTAL_PEDIDO
                FROM CLIENTE C JOIN PEDIDO P
                ON C.COD_CLIENTE = P.COD_CLIENTE
                WHERE YEAR ("DATA DO PEDIDO") = '2020'
                ORDER BY "NOME DO CLIENTE";
    * ### [8-A empresa solicitou que você providencie uma query para listar todos os serviços e os respectivos fornecedores, ordenando essa lista alfabeticamente pelo nome do fornecedor e descendentemente pelo valor do serviço. A lista deve possuir as colunas NOM_FORNECEDOR, NUM_TELEFONE, DSC_SERVICO, TIP_SERVICO e VLR_SERVICO. Foi solicitado também que a query use o padrão ANSI-92 para relacionar as tabelas.](#ancora8)
    
    * ### [9- A empresa irá fazer uma enxugada no portfólio atual, de forma que consiga oferecer novos serviços que estão sendo criados pelos fornecedores. Para isso, ela precisa que você elabore uma query que liste os serviços que nunca foram vendidos, ou que tiveram um total de vendas menor que 5 em 2019. O relatório precisa conter as colunas DSC_SERVICO, TIP_SERVICO, VLR_SERVICO e NOM_FORNECEDOR. Foi solicitado que a query, neste caso, use padrão ANSI-89 para relacionar as tabelas.](#ancora9)
    
    * ### [10-Devido a algum problema na aplicação, alguns pedidos estão sem o valor total do pedido (coluna VLR_TOTAL_PEDIDO da tabela PEDIDO está nula), ou com valor calculado erroneamente (deveria ser a soma de todos os valores, do mesmo pedido, da coluna VLR_TOTAL_ITEM da tabela ITEM_PEDIDO). A empresa solicita que você desenvolva uma query para listar os pedidos que estão com esse problema. A query deve retornar as colunas NUM_PEDIDO, DAT_PEDIDO e VLR_TOTAL_PEDIDO. A empresa também solicita que você escreva a query para atualizar a coluna VLR_TOTAL_PEDIDO de forma correta.](#ancora10)
    
    * ### [11-Foi identificado um problema no modelo de dados original, no qual a coluna NUM_CPF_CNPJ da tabela CLIENTE foi criada de forma a aceitar nulo. Com o intuito de verificar o tamanho do problema, a empresa solicitou a um de seus desenvolvedores que elaborasse uma query para listar o percentual de clientes cadastrados que estão sem essa informação. O desenvolvedor criou a query abaixo:](#ancora11)
            * SELECT CAST
            (
            ( SELECT CAST(COUNT (NUM_CPF_CNPJ) AS numeric (3,2))
            FROM CLIENTE WHERE NUM_CPF_CNPJ IS NULL
            )
            /
            ( SELECT CAST(COUNT (NUM_CPF_CNPJ) AS numeric (3,2))
            FROM CLIENTE
            ) * 100 AS int
            ) AS "Percentual de Clientes sem Informação de Documento"
            A empresa constatou que não há nenhum erro de sintaxe na query, mas
            solicitou sua consultoria para informar se a query calculará o percentual
            de clientes cadastrados sem CPF/CNPJ de forma correta. Em caso
            negativo, ela solicita que você forneça a query com o ajuste necessário.
    
    * ### [12-.Foi feita uma regulamentação nova para sistemas de venda de serviços on-line, onde todas as informações disponibilizadas para os clientes no site devem ser exibidas em letras MAIÚSCULAS. A alteração na camada da aplicação para os novos dados serem inseridos já foi feita, mas é preciso tratar o backlog das informações que já se encontravam persistidas no banco de dados. De acordo com o modelo de dados, existem 7 colunas do tipo string que precisam ter os dados alterados para maiúsculo. O desenvolvedor informou que seriam necessários 7 comandos DML para fazer essa alteração, mas você disse que consegue otimizar para fazer com 4 comandos. Quais seriam esses 4 comandos?](#ancora12)
    
    * ### [13-A empresa precisará de um relatório que liste a quantidade de itens vendidos mensalmente e o valor total desses itens por fornecedor, no ano corrente. Todos os fornecedores devem estar listados, mesmo se ainda não tiver nenhum produto vendido. Selecione as instruções abaixo que serão necessárias para essa query e coloque-as na devida ordem.](#ancora13)
            * GROUP BY F.NOM_FORNECEDOR, P.DAT_PEDIDO
             SELECT F.NOM_FORNECEDOR, MONTH(P.DAT_PEDIDO) AS MÊS,
             SUM(I.QTD_SERVICO) AS "TOTAL DE ITENS",
             LEFT JOIN SERVICO S
             GROUP BY F.NOM_FORNECEDOR
             FROM FORNECEDOR F
             COUNT(I.QTD_SERVICO) AS "TOTAL DE ITENS",
             ON I.NUM_PEDIDO = P.NUM_PEDIDO
             INNER JOIN SERVICO S
             ORDER BY F.NOM_FORNECEDOR
             GROUP BY F.NOM_FORNECEDOR, MONTH (P.DAT_PEDIDO)
             JOIN ITEM_PEDIDO I
             ON S.COD_SERVICO = I.COD_SERVICO
             SUM(I.VLR_TOTAL_ITEM) AS "VALOR TOTAL"
             ON F.COD_FORNECEDOR = S.COD_FORNECEDOR
             JOIN PEDIDO P
             RIGHT JOIN PEDIDO P
             WHERE YEAR(P.DAT_PEDIDO) = YEAR(GETDATE())
             HAVING YEAR(P.DAT_PEDIDO) = YEAR(GETDATE())
    
    * ### [14-Para retornar a lista de clientes que não fizeram pedidos, foi construída a query abaixo.](#ancora14)       
          * SELECT NOM_CLIENTE, NUM_TELEFONE
            FROM CLIENTE
            WHERE COD_CLIENTE NOT IN (SELECT COD_CLIENTE FROM PEDIDO)
            ORDER BY NOM_CLIENTE;                
            A empresa solicita sua consultoria para informar se a query em questão
            atende ao requisito (listar clientes que não fizeram pedidos), se há uma
            forma mais otimizada de obter o mesmo resultado e qual seria essa query.        
        
    * ### [15-Foi encontrada a query abaixo no código da aplicação e a empresa está solicitando sua ajuda para identificar o que essa query faz. Em adição, informe uma query mais otimizada para atingir o mesmo resultado,sem utilizar uma subconsulta correlacionada ou multivalorada.](#ancora15)
          * SELECT C.NOM_CLIENTE, C.NUM_TELEFONE
            FROM CLIENTE C
            WHERE EXISTS (
            SELECT P.COD_CLIENTE
            FROM PEDIDO P
            WHERE P.COD_CLIENTE = C.COD_CLIENTE
            )
            ORDER BY C.NOM_CLIENTE;
            A empresa solicitou que você elabore uma query para gerar uma cópia dos
            dados da tabela ITEM_PEDIDO. Essa tabela com a cópia dos dados deve se
            chamar TMP_ITEM_PEDIDO.
                    
    * ### [16-A empresa solicitou que você elabore uma query para excluir os clientes que estão cadastrados no banco de dados, mas que não fizeram nenhum pedido.](#ancora16)
    
    * ### [17. Foi solicitado que você gere uma query para inserir os dados abaixo na tabela FORMA_PAGAMENTO, que funcione independentemente da ordem que as colunas foram criadas.](#ancora17)
    ![img](./tab.png)
    
    * ### [18-Dado o código abaixo:](#ancora18)
          *  BEGIN TRANSACTION Transacao1
            INSERT INTO FORMA_PAGAMENTO
            (COD_FORMA_PAGAMENTO, DSC_FORMA_PAGAMENTO)
            VALUES (1, 'CARTÃO DE DÉBITO');
            BEGIN TRANSACTION Transacao2
            INSERT INTO FORMA_PAGAMENTO
            (COD_FORMA_PAGAMENTO, DSC_FORMA_PAGAMENTO)
            VALUES (2, 'CARTÃO DE CRÉDITO');
            SELECT * FROM FORMA_PAGAMENTO ORDER BY 1;
            COMMIT TRANSACTION Transacao2
            INSERT INTO FORMA_PAGAMENTO
            (COD_FORMA_PAGAMENTO, DSC_FORMA_PAGAMENTO)
            VALUES (3, 'BOLETO');
            SELECT @@TRANCOUNT AS 'PRIMEIRA CONTAGEM';
            SELECT *
            FROM FORMA_PAGAMENTO
            ORDER BY DSC_FORMA_PAGAMENTO;
            COMMIT TRANSACTION Transacao1
            INSERT INTO FORMA_PAGAMENTO
            (COD_FORMA_PAGAMENTO, DSC_FORMA_PAGAMENTO)
            VALUES (4, 'FATURA');
            SELECT @@TRANCOUNT AS 'SEGUNDA CONTAGEM';
            SELECT * FROM FORMA_PAGAMENTO;
            **Informe quais os dados serão retornados para cada um dos comandos**
            SELECT executados dentro da query acima:
            • SELECT * FROM FORMA_PAGAMENTO ORDER BY 1 
            • SELECT @@TRANCOUNT AS 'PRIMEIRA CONTAGEM' 
            • SELECT * FROM FORMA_PAGAMENTO
            o ORDER BY DSC_FORMA_PAGAMENTO
            • SELECT @@TRANCOUNT AS 'SEGUNDA CONTAGEM' 
            • SELECT * FROM FORMA_PAGAMENTO 
            
    * ### [19-Após a execução do bloco SQL abaixo, quantas linhas de fato serão inseridas na tabela FORMA_PAGAMENTO?](#ancora19)
            *  BEGIN TRANSACTION Transacao1
            INSERT INTO FORMA_PAGAMENTO
            (COD_FORMA_PAGAMENTO, DSC_FORMA_PAGAMENTO)
            VALUES (199, 'CARTÃO DE DÉBITO');
            BEGIN TRANSACTION Transacao2
            INSERT INTO FORMA_PAGAMENTO
            (COD_FORMA_PAGAMENTO, DSC_FORMA_PAGAMENTO)
            VALUES (299, 'CARTÃO DE CRÉDITO');
            COMMIT TRANSACTION Transacao2
            INSERT INTO FORMA_PAGAMENTO
            (COD_FORMA_PAGAMENTO, DSC_FORMA_PAGAMENTO)
            VALUES (399, 'BOLETO');
            ROLLBACK
            COMMIT TRANSACTION Transacao1
            INSERT INTO FORMA_PAGAMENTO
            (COD_FORMA_PAGAMENTO, DSC_FORMA_PAGAMENTO)
            VALUES (499, 'FATURA')
            
    * ### [20-Foi solicitada a você a criação de um objeto de código compilado (uma procedure) para fazer a inserção de dados na tabela CLIENTE de forma que os dados sejam passados como parâmetros. Forneça o código DDL para a criação dessa procedure, de nome SP_INSERE_CLIENTE, e o exemplo de execução dela.](#ancora20)    
    
    * ### [21..A empresa solicitou que você construa o script DCL de forma que o usuário da aplicação de nome UserApp tenha permissão para selecionar, inserir, atualizar e excluir dados de todas as tabelas, mas não tenha permissão de inserção direta na tabela CLIENTE (para inserir dados de cliente, o usuário deverá usar uma procedure, de nome SP_INSERE_CLIENTE). Forneça os comandos que devem estar nesse script DCL.](#ancora21)

## Contexto.
<a id="ancora1"></a>
[voltar](#ancora).

* As tabelas Titulo e Titulo_Detalhe permitem armazenar informações básicas e técnicas sobre as produções, enquanto as tabelas Avaliacao, Direcao, Autoria e Elenco permitem armazenar informações específicas sobre os aspectos críticos, direção e elenco de cada produção.
* A tabela Pessoa é importante para garantir a integridade dos dados, pois permite que todas as pessoas envolvidas na produção sejam identificadas de maneira única.
* Além disso, é importante estabelecer relações adequadas entre as tabelas para garantir a integridade dos dados e a consistência do modelo de dados. Por exemplo, a tabela Direcao deve ter uma relação com a tabela Titulo para indicar quais diretores estão associados a quais produções, e a tabela Pessoa deve ter uma relação com as tabelas Direcao, Autoria e Elenco para identificar as pessoas envolvidas na produção.

## Atividades:
<a id="ancora3"></a>
[voltar](#ancora).

###  **Criar a conexão com o MySQL.**  
<a id="ancora0.1"></a>
[voltar](#ancora).

In [1]:
#importação das bibliotecas para conexão 1
import mysql.connector
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

###  **1.Solução .**
<a id="ancora1"></a>
[voltar](#ancora).

In [ ]:
# Excluír o banco de dados.
drop_bd='''
DROP DATABASE e-commerce-xpe;'''
cursor.execute(drop_bd)
cursor.execute('SHOW databases')
for i in cursor:
    if 'bdproducoes' in i:
        print(i)

In [4]:
# Criando o banco de dados e-commerce-xpe e conferindo se o bd foi criado;
criar='''CREATE SCHEMA IF NOT EXISTS `e-commerce-xpe` ;'''
con = mysql.connector.connect(host='localhost',user='julio',password='')
cursor = con.cursor()
cursor.execute(criar)
cursor.execute('SHOW databases')
for i in cursor:
    if 'e-commerce-xpe' in i:
        print(i)

('e-commerce-xpe',)

In [5]:
# Conectando ao database e-commerce-xpe recém criada
con = mysql.connector.connect(host='localhost',database='e-commerce-xpe',user='julio',password='')
cursor = con.cursor()

#### CRIANDO A TABELA CLIENTE

In [6]:
# Criando a tabela de CLIENTE;
criar='''
CREATE TABLE IF NOT EXISTS CLIENTE (
  COD_CLIENTE INT NOT NULL,
  NOM_CLIENTE VARCHAR(100) NOT NULL,
  NUM_CPF_CNPJ DECIMAL(15) NULL,
  DSC_ENDERECO_COBRANCA VARCHAR(1000) NOT NULL,
  NUM_TELEFONE DECIMAL(14) NOT NULL,
  PRIMARY KEY (COD_CLIENTE))
ENGINE = InnoDB;
'''
cursor.execute(criar)
cursor.execute('SHOW tables')
for i in cursor:
  print(i)

('cliente',)

#### CRIANDO A TABELA FORMA_PAGAMENTO

In [7]:
# Criando a tabela de FORMA_PAGAMENTO;
criar='''
CREATE TABLE IF NOT EXISTS FORMA_PAGAMENTO (
  COD_FORMA_PAGAMENTO INT NOT NULL,
  DSC_FORMA_PAGAMENTO VARCHAR(100) NOT NULL,
  PRIMARY KEY (COD_FORMA_PAGAMENTO))
ENGINE = InnoDB;
'''
cursor.execute(criar)
cursor.execute('SHOW tables')
for i in cursor:
  print(i)

('cliente',)
('forma_pagamento',)

#### CRIANDO A TABELA PEDIDO

In [11]:
# Criando a tabela de PEDIDO;
criar='''
CREATE TABLE IF NOT EXISTS PEDIDO (
  NUM_PEDIDO VARCHAR(45) NOT NULL,
  COD_CLIENTE_FK INT NOT NULL,
  DAT_PEDIDO DATE NOT NULL,
  VLR_TOTAL_PEDIDO DECIMAL(10,2) NULL,
  COD_FORMA_PAGAMENTO_FK INT NOT NULL,
  PRIMARY KEY (NUM_PEDIDO),  
  CONSTRAINT fk_PEDIDO_CLIENTE
  FOREIGN KEY (COD_CLIENTE_FK)
    REFERENCES CLIENTE (COD_CLIENTE),    
  CONSTRAINT fk_PEDIDO_FORMA_PAGAMENTO
    FOREIGN KEY (COD_FORMA_PAGAMENTO_FK)
    REFERENCES FORMA_PAGAMENTO (COD_FORMA_PAGAMENTO))    
ENGINE = InnoDB;'''
cursor.execute(criar)
cursor.execute('SHOW tables')
for i in cursor:
  print(i)

('cliente',)
('forma_pagamento',)
('pedido',)

#### CRIANDO A TABELA FORNECEDOR

In [12]:
# Criando a tabela de FORNCECEDOR;
criar='''
CREATE TABLE IF NOT EXISTS FORNECEDOR (
  COD_FORNECEDOR INT NOT NULL,
  NOM_FORNECEDOR VARCHAR(100) NOT NULL,
  NUM_CNPJ DECIMAL(15) NULL,
  DSC_ENDERECO VARCHAR(1000) NOT NULL,
  NUM_TELEFONE DECIMAL(14) NOT NULL,
  PRIMARY KEY (COD_FORNECEDOR))
ENGINE = InnoDB;
'''
cursor.execute(criar)
cursor.execute('SHOW tables')
for i in cursor:
  print(i)

('cliente',)
('forma_pagamento',)
('fornecedor',)
('pedido',)

#### CRIANDO A TABELA SERVICO

In [13]:
# Criando a tabela de SERVICO;
criar='''
CREATE TABLE IF NOT EXISTS SERVICO (
  COD_SERVICO INT NOT NULL,
  COD_FORNECEDOR_FK INT NOT NULL,
  DSC_SERVICO VARCHAR(500) NOT NULL,
  TIP_SERVICO VARCHAR(50) NOT NULL,
  VLR_SERVICO DECIMAL(10,2) NOT NULL,
  PRIMARY KEY (COD_SERVICO),  
  CONSTRAINT fk_SERVICO_FORNECEDOR
    FOREIGN KEY (COD_FORNECEDOR_FK)
    REFERENCES FORNECEDOR (COD_FORNECEDOR))
ENGINE = InnoDB;
'''
cursor.execute(criar)
cursor.execute('SHOW tables')
for i in cursor:
  print(i)

('cliente',)
('forma_pagamento',)
('fornecedor',)
('pedido',)
('servico',)

#### CRIANDO A TABELA ITEM_PEDIDO

In [16]:
# Criando a tabela de ITEM_PEDIDO;
criar='''
CREATE TABLE IF NOT EXISTS ITEM_PEDIDO (
  NUM_PEDIDO_FK VARCHAR(45) NOT NULL,
  COD_ITEM_PEDIDO INT NOT NULL,
  COD_SERVICO_FK INT NOT NULL,
  QTD_SERVICO DECIMAL(2) NOT NULL,
  VLR_TOTAL_ITEM DECIMAL(10,2) NOT NULL,
  PRIMARY KEY (NUM_PEDIDO_FK, COD_ITEM_PEDIDO),  
  CONSTRAINT fk_ITEM_PEDIDO_SERVICO
    FOREIGN KEY (COD_SERVICO_FK)
    REFERENCES SERVICO (COD_SERVICO),    
  CONSTRAINT fk_ITEM_PEDIDO_PEDIDO
    FOREIGN KEY (NUM_PEDIDO_FK)
    REFERENCES PEDIDO (NUM_PEDIDO))
ENGINE = InnoDB;
'''
cursor.execute(criar)
cursor.execute('SHOW tables')
for i in cursor:
  print(i)

('cliente',)
('forma_pagamento',)
('fornecedor',)
('item_pedido',)
('pedido',)
('servico',)

###  **2.Solução .**
<a id="ancora2"></a>
[voltar](#ancora).

#### Criando a tabela de Pessoa;

In [26]:
# Criando a tabela de Pessoa;
criar='''
CREATE TABLE IF NOT EXISTS Pessoa (
  cod_pessoa INT PRIMARY KEY,
  nom_pessoa VARCHAR(500) NOT NULL,
  ano_nascimento INT NULL,
  ano_falescimento INT NULL,
  dsc_profissao VARCHAR(1000) NULL
);'''
cursor.execute(criar)
cursor.execute('SHOW tables')
for i in cursor:
  print(i)

('pessoa',)

#### Criando a tabela de Titulo;

In [27]:
#Criando a tabela de Titulo;
criar='''
CREATE TABLE IF NOT EXISTS Titulo (
  cod_titulo INT NOT NULL PRIMARY KEY,
  nom_titulo VARCHAR(1000) NULL  
);'''
cursor.execute(criar)
cursor.execute('SHOW tables')
for i in cursor:
  print(i)

('pessoa',)
('titulo',)

#### Criando a tabela de Direção;

In [28]:
#Criando a tabela de Direcao;
criar='''
CREATE TABLE IF NOT EXISTS Direcao (
  cod_direcao INT PRIMARY KEY AUTO_INCREMENT,
  cod_titulo INT NOT NULL,
  cod_pessoa INT NOT NULL,
  FOREIGN KEY (cod_pessoa) REFERENCES Pessoa(cod_pessoa),
  FOREIGN KEY (cod_titulo) REFERENCES Titulo(cod_titulo)
);'''
cursor.execute(criar)
cursor.execute('SHOW tables')
for i in cursor:
  print(i)

('direcao',)
('pessoa',)
('titulo',)

#### Criando a tabela de Titulo_Detalhe;

In [29]:
#Criando a tabela de Titulo_Detalhe;
criar='''
CREATE TABLE IF NOT EXISTS Titulo_Detalhe (
  cod_titulo INT NOT NULL,
  tip_titulo VARCHAR(100) NOT NULL,
  nom_principal_titulo VARCHAR(1000) NOT NULL,
  nom_original_titulo VARCHAR(1000) NOT NULL,
  ind_adulto BIT NOT NULL,
  ano_lancamento INT NOT NULL,
  qtd_minutos SMALLINT NULL,
  dsc_genero VARCHAR(1000) NULL,
  genero VARCHAR(50) NOT NULL,
  FOREIGN KEY (cod_titulo) REFERENCES Titulo(cod_titulo)
);'''
cursor.execute(criar)
cursor.execute('SHOW tables')
for i in cursor:
  print(i)

('direcao',)
('pessoa',)
('titulo',)
('titulo_detalhe',)

#### Criando a tabela de Elenco;

In [30]:
#Criando a tabela de Elenco;
criar='''
CREATE TABLE IF NOT EXISTS Elenco (
  cod_elenco INT PRIMARY KEY AUTO_INCREMENT,
  cod_titulo INT NOT NULL,
  cod_pessoa INT NOT NULL,
  dsc_funcao VARCHAR(1000) NOT NULL,
  dsc_personagem VARCHAR(1000) NOT NULL,
  FOREIGN KEY (cod_titulo) REFERENCES Titulo(cod_titulo),
  FOREIGN KEY (cod_pessoa) REFERENCES Pessoa(cod_pessoa)
);'''
cursor.execute(criar)
cursor.execute('SHOW tables')
for i in cursor:
  print(i)

('direcao',)
('elenco',)
('pessoa',)
('titulo',)
('titulo_detalhe',)

#### Criando a tabela de Autoria;

In [31]:
#Criando a tabela de Autoria;
criar='''
CREATE TABLE IF NOT EXISTS Autoria (
  cod_autoria INT PRIMARY KEY AUTO_INCREMENT,
  cod_titulo INT NOT NULL,
  cod_pessoa INT NOT NULL,
  FOREIGN KEY (cod_titulo) REFERENCES Titulo(cod_titulo),
  FOREIGN KEY (cod_pessoa) REFERENCES Pessoa(cod_pessoa)
);'''
cursor.execute(criar)
cursor.execute('SHOW tables')
for i in cursor:
  print(i)

('autoria',)
('direcao',)
('elenco',)
('pessoa',)
('titulo',)
('titulo_detalhe',)

#### Criando a tabela de Avaliacao;

In [32]:
#Criando a tabela de Avaliacao;
criar='''
CREATE TABLE IF NOT EXISTS Avaliacao (
  cod_titulo INT NOT NULL,
  classificacao_media INT NOT NULL,
  qtd_votos INT NOT NULL,
  FOREIGN KEY (cod_titulo) REFERENCES Titulo(cod_titulo)
);'''
cursor.execute(criar)
cursor.execute('SHOW tables')
for i in cursor:
  print(i)

('autoria',)
('avaliacao',)
('direcao',)
('elenco',)
('pessoa',)
('titulo',)
('titulo_detalhe',)

###  **3.Solução.**
<a id="ancora3"></a>
[voltar](#ancora).

In [33]:
# Alterando a tabela titulo;
Altera='''
ALTER TABLE titulo
MODIFY COLUMN nom_titulo VARCHAR(1000) NOT NULL;'''
cursor.execute(Altera)
cursor.execute('desc titulo')
for i in cursor:
  print(i)

('cod_titulo', b'int', 'NO', bytearray(b'PRI'), None, '')
('nom_titulo', b'varchar(1000)', 'NO', bytearray(b''), None, '')

###  **4.Solução .**
<a id="ancora4"></a>
[voltar](#ancora).

In [34]:
# Criando a tabela de Pessoa;
Altera='''
ALTER TABLE Pessoa
MODIFY COLUMN nom_pessoa VARCHAR(1000);'''
cursor.execute(Altera)
cursor.execute('desc pessoa')
for i in cursor:
  print(i)

('cod_pessoa', b'int', 'NO', bytearray(b'PRI'), None, '')
('nom_pessoa', b'varchar(1000)', 'YES', bytearray(b''), None, '')
('ano_nascimento', b'int', 'YES', bytearray(b''), None, '')
('ano_falescimento', b'int', 'YES', bytearray(b''), None, '')
('dsc_profissao', b'varchar(1000)', 'YES', bytearray(b''), None, '')

###  **5.Solução .**
<a id="ancora5"></a>
[voltar](#ancora).

In [35]:
# Criando a tabela de Titulo;
Altera='''
ALTER TABLE titulo
ADD COLUMN ind_status CHAR(1) NOT NULL DEFAULT 'A';'''
cursor.execute(Altera)
cursor.execute('desc titulo')
for i in cursor:
  print(i)

('cod_titulo', b'int', 'NO', bytearray(b'PRI'), None, '')
('nom_titulo', b'varchar(1000)', 'NO', bytearray(b''), None, '')
('ind_status', b'char(1)', 'NO', bytearray(b''), b'A', '')

**Nota: No exemplo acima, o valor padrão de ind_status é 'A', o que significa "ativo".**

###  **6.Solução .**
<a id="ancora6"></a>
[voltar](#ancora).

####  **Persistindo dados na tabela Pessoa.**
<a id="ancora3.7.1"></a>
[voltar](#ancora).

In [69]:
cursor.execute('SET sql_mode = "" ') # necessário pois não estava aceitando carregar os valores em branco.

In [70]:
load = '''LOAD DATA INFILE 'C://ProgramData//MySQL//MySQL Server 8.0//Uploads//Pessoa.txt'
                INTO TABLE pessoa 
                CHARACTER SET LATIN1
                FIELDS TERMINATED BY '\t'
                LINES TERMINATED BY '\r\n';
        '''
# Consultando uma tabela.
cursor = con.cursor()
cursor.execute(load)

In [14]:
# Consultando a tabela.
cursor = con.cursor()
cursor.execute('SELECT * FROM pessoa LIMIT 10')
result = cursor.fetchall()
for i in result:
    print(i)

(1, 'Fred Astaire', 1899, 1987, 'soundtrack,actor,miscellaneous')
(2, 'Lauren Bacall', 1924, 2014, 'actress,soundtrack')
(3, 'Brigitte Bardot', 1934, 0, 'actress,soundtrack,producer')
(4, 'John Belushi', 1949, 1982, 'actor,writer,soundtrack')
(5, 'Ingmar Bergman', 1918, 2007, 'writer,director,actor')
(6, 'Ingrid Bergman', 1915, 1982, 'actress,soundtrack,producer')
(7, 'Humphrey Bogart', 1899, 1957, 'actor,soundtrack,producer')
(8, 'Marlon Brando', 1924, 2004, 'actor,soundtrack,director')
(9, 'Richard Burton', 1925, 1984, 'actor,producer,soundtrack')
(10, 'James Cagney', 1899, 1986, 'actor,soundtrack,director')

In [15]:
# Lib para visualizar as consultas em formato de dataframe.
import pandas as pd

In [16]:
# Convertendo as consulta para o tipo pandas dataset - apenas para facilitar a visualização.
pd.read_sql('SELECT * FROM pessoa LIMIT 10',con=con)

,cod_pessoa,nom_pessoa,ano_nascimento,ano_falescimento,dsc_profissao
0,1,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous"
1,2,Lauren Bacall,1924,2014,"actress,soundtrack"
2,3,Brigitte Bardot,1934,0,"actress,soundtrack,producer"
3,4,John Belushi,1949,1982,"actor,writer,soundtrack"
4,5,Ingmar Bergman,1918,2007,"writer,director,actor"
5,6,Ingrid Bergman,1915,1982,"actress,soundtrack,producer"
6,7,Humphrey Bogart,1899,1957,"actor,soundtrack,producer"
7,8,Marlon Brando,1924,2004,"actor,soundtrack,director"
8,9,Richard Burton,1925,1984,"actor,producer,soundtrack"
9,10,James Cagney,1899,1986,"actor,soundtrack,director"

####  **Persistindo dados na tabela Título.**
<a id="ancora3.8"></a>
[voltar](#ancora).

In [74]:
# -- persistindo registros na tabela Titulo --
load = '''LOAD DATA INFILE 'C://ProgramData//MySQL//MySQL Server 8.0//Uploads//Titulo.txt' 
                INTO TABLE titulo 
                CHARACTER SET LATIN1
                FIELDS TERMINATED BY '\t'
                LINES TERMINATED BY '\r\n';
        '''
# Consultando uma tabela.
cursor = con.cursor()
cursor.execute(load)

In [19]:
# Convertendo as consulta para o tipo pandas dataset - apenas para facilitar a visualização.
pd.read_sql('SELECT * FROM titulo LIMIT 10',con=con)

   cod_titulo                                   nom_titulo ind_status
0           1                                   Carmencita          A
1           2                       Le clown et ses chiens          A
2           3                               Pauvre Pierrot          A
3           4                                  Un bon bock          A
4           5                             Blacksmith Scene          A
5           6                            Chinese Opium Den          A
6           7  Corbett and Courtney Before the Kinetograph          A
7           8       Edison Kinetoscopic Record of a Sneeze          A
8           9                                   Miss Jerry          A
9          10          La sortie de l'usine Lumière à Lyon          A

####  **Persistindo dados na tabela Direção.**
<a id="ancora3.9"></a>
[voltar](#ancora).

In [76]:
# -- persistindo registros na tabela Direção --
load = '''LOAD DATA INFILE 'C://ProgramData//MySQL//MySQL Server 8.0//Uploads//Direcao.txt' 
                INTO TABLE direcao 
                CHARACTER SET LATIN1
                FIELDS TERMINATED BY '\t'
                LINES TERMINATED BY '\r\n'; 
        '''
# Consultando uma tabela.
cursor = con.cursor()
cursor.execute(load)

In [86]:
# Convertendo as consulta para o tipo pandas dataset - apenas para facilitar a visualização.
pd.read_sql('SELECT * FROM direcao LIMIT 10',con=con)

   cod_direcao  cod_titulo  cod_pessoa
0            1           1        5690
1            2           2      721526
2            3           3      721526
3            4           4      721526
4            5           5        5690
5            6           6        5690
6            7           8        5690
7            8           9       85156
8            9          10      525910
9           10          11      804434

####  **Persistindo dados na tabela Titulo_Detalhe.**
<a id="ancora3.10"></a>
[voltar](#ancora).

In [78]:
# -- persistindo registros na tabela Titulo_Detalhe --
load = '''LOAD DATA INFILE 'C://ProgramData//MySQL//MySQL Server 8.0//Uploads//Titulo_Detalhe.txt' 
                INTO TABLE titulo_detalhe 
                CHARACTER SET LATIN1
                FIELDS TERMINATED BY '\t'
                LINES TERMINATED BY '\r\n'; 
        '''
# Consultando uma tabela.
cursor = con.cursor()
cursor.execute(load)

In [79]:
# Convertendo as consulta para o tipo pandas dataset - apenas para facilitar a visualização.
pd.read_sql('SELECT * FROM titulo_detalhe LIMIT 10',con=con)

,cod_titulo,tip_titulo,nom_principal_titulo,nom_original_titulo,ind_adulto,ano_lancamento,qtd_minutos,dsc_genero,genero
0,1,short,Carmencita,Carmencita,1,1894,1,"Documentary,Short",
1,2,short,Le clown et ses chiens,Le clown et ses chiens,1,1892,5,"Animation,Short",
2,3,short,Pauvre Pierrot,Pauvre Pierrot,1,1892,4,"Animation,Comedy,Romance",
3,4,short,Un bon bock,Un bon bock,1,1892,0,"Animation,Short",
4,5,short,Blacksmith Scene,Blacksmith Scene,1,1893,1,"Comedy,Short",
5,6,short,Chinese Opium Den,Chinese Opium Den,1,1894,1,Short,
6,7,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,1,1894,1,"Short,Sport",
7,8,short,Edison Kinetoscopic Record of a Sneeze,Edison Kinetoscopic Record of a Sneeze,1,1894,1,"Documentary,Short",
8,9,movie,Miss Jerry,Miss Jerry,1,1894,45,Romance,
9,10,short,Exiting the Factory,La sortie de l'usine Lumière à Lyon,1,1895,1,"Documentary,Short",

####  **Persistindo dados na tabela Elenco.**
<a id="ancora3.11"></a>
[voltar](#ancora).

In [80]:
# -- persistindo registros na tabela Elenco --
load = '''LOAD DATA INFILE 'C://ProgramData//MySQL//MySQL Server 8.0//Uploads//Elenco.txt' 
                INTO TABLE Elenco 
                CHARACTER SET LATIN1
                FIELDS TERMINATED BY '\t'
                LINES TERMINATED BY '\r\n'; 
        '''
# Consultando uma tabela.
cursor = con.cursor()
cursor.execute(load)

In [81]:
# Convertendo as consulta para o tipo pandas dataset - apenas para facilitar a visualização.
pd.read_sql('SELECT * FROM elenco LIMIT 10',con=con)

   cod_elenco  cod_titulo  cod_pessoa       dsc_funcao  dsc_personagem
0           1           1     1588970             self     ["Herself"]
1           2           1        5690         director
2           3           1      374658  cinematographer
3           4           2      721526         director
4           5           2     1335271         composer
5           6           3      721526         director
6           7           3     1335271         composer
7           8           4      721526         director
8           9           4     1335271         composer
9          10           5      443482            actor  ["Blacksmith"]

####  **Persistindo dados na tabela Autoria.**
<a id="ancora3.12"></a>
[voltar](#ancora).

In [82]:
# -- persistindo registros na tabela Autoria --
load = '''LOAD DATA INFILE 'C://ProgramData//MySQL//MySQL Server 8.0//Uploads//Autoria.txt' 
                INTO TABLE Autoria 
                CHARACTER SET LATIN1
                FIELDS TERMINATED BY '\t'
                LINES TERMINATED BY '\r\n'; 
        '''
# Consultando uma tabela.
cursor = con.cursor()
cursor.execute(load)

In [83]:
# Convertendo as consulta para o tipo pandas dataset - apenas para facilitar a visualização.
pd.read_sql('SELECT * FROM autoria LIMIT 10',con=con)

   cod_autoria  cod_titulo  cod_pessoa
0            1           9       85156
1            2          36      410331
2            3          76      410331
3            4          91      617588
4            5         108      410331
5            6         109      410331
6            7         110      410331
7            8         111      410331
8            9         112      410331
9           10         113      410331

####  **Persistindo dados na tabela Avaliacao.**
<a id="ancora3.13"></a>
[voltar](#ancora).

In [84]:
# -- persistindo registros na tabela Avaliacao --
load = '''LOAD DATA INFILE 'C://ProgramData//MySQL//MySQL Server 8.0//Uploads//Avaliacao.txt' 
                INTO TABLE Avaliacao 
                CHARACTER SET LATIN1
                FIELDS TERMINATED BY '\t'
                LINES TERMINATED BY '\r\n'; 
        '''
# Consultando uma tabela.
cursor = con.cursor()
cursor.execute(load)

In [87]:
# Convertendo as consulta para o tipo pandas dataset - apenas para facilitar a visualização.
pd.read_sql('SELECT * FROM Avaliacao LIMIT 10',con=con)

   cod_titulo  classificacao_media  qtd_votos
0        1049                   36          8
1        1062                   61        956
2        1066                   38          5
3        1072                   56        206
4        1083                   54         82
5        1084                   51        124
6        1091                   54        139
7        1101                   45         14
8        1105                   65        685
9        1112                   33         14

### **7.Solução .** 
<a id="ancora7"></a>
[voltar](#ancora).

#### **a. Total de títulos ativos.**
<a id="ancora4.2"></a>
[voltar](#ancora).

In [3]:
# Total de titulos Ativos.
query = '''SELECT 
    COUNT(*)
FROM
    titulo
WHERE
    ind_status = 'A';
        '''
cursor = con.cursor()
cursor.execute(query)
result = cursor.fetchall()
for i in result:
    print(i)

(19614,)

#### **b. Relação dos títulos em ordem alfabética e seus detalhes.**
<a id="ancora4.3"></a>
[voltar](#ancora).

In [6]:
# Relação da tab. titulo com titulos detalhes ordenado por nome.
query = '''SELECT 
    t.cod_titulo AS codigo,
    t.nom_titulo AS nome,
    d.tip_titulo AS tipo,
    d.ano_lancamento AS ano,
    d.qtd_minutos AS duração,
    d.dsc_genero AS genero
FROM
    titulo t
        JOIN
    titulo_detalhe d ON t.cod_titulo = d.cod_titulo
ORDER BY t.nom_titulo;
        '''
pd.read_sql(query,con).head(10)

,codigo,nome,tipo,ano,duração,genero
0,22731,-But the Flesh Is Weak,movie,1932,77,Comedy
1,28533,"¡Centinela, alerta!",movie,1937,80,Musical
2,22756,¡Que viva Mexico!,movie,1932,88,History
3,24642,¡Tango!,movie,1933,80,"Musical,Romance"
4,8805,¿Quién me hará olvidar sin morir?,movie,1916,0,
5,28534,¿Quién me quiere a mí?,movie,1936,84,Drama
6,24806,...heute abend bei mir,movie,1934,91,
7,26026,...nur ein Komödiant,movie,1935,95,
8,31761,...One Third of a Nation...,movie,1939,79,Drama
9,32177,...som en tjuv om natten,movie,1940,98,Comedy

* **Apesar de nome estar ordenado podemos ver que existem os critérios dos caracteres**

#### **c. Relação dos títulos em ordem alfabética, seus autores e diretores(quando existirem essas duas últimas informações).**
<a id="ancora4.4"></a>
[voltar](#ancora).

In [7]:
query ='''SELECT 
    T.nom_titulo AS 'Nome do Título',
    aut.nom_pessoa AS 'Autor',
    dir.nom_pessoa AS 'Diretor'
FROM
    Titulo AS T
        LEFT JOIN
    autoria AS TA ON T.cod_titulo = TA.cod_titulo
        LEFT JOIN
    pessoa AS aut ON TA.cod_pessoa = aut.cod_pessoa
        LEFT JOIN
    direcao AS TD ON T.cod_titulo = TD.cod_titulo
        LEFT JOIN
    pessoa AS dir ON TD.cod_pessoa = dir.cod_pessoa
WHERE
    aut.nom_pessoa IS NOT NULL
        AND dir.nom_pessoa IS NOT NULL
ORDER BY T.nom_titulo ASC; '''
pd.read_sql(query,con).head(10)

                Nome do Título               Autor             Diretor
0       -But the Flesh Is Weak        Ivor Novello         Jack Conway
1              .45 Calibre War          Ford Beebe      Leo D. Maloney
2         'Blue Blazes' Rawden          J.G. Hawks     William S. Hart
3      'Midst Woodland Shadows          Ralph Ince          Ralph Ince
4     'Neath the Arizona Skies      Burl R. Tuttle     Harry L. Fraser
5         'Neath Western Skies       Sally Winters        J.P. McGowan
6  'Round the World in 80 Days         Jules Verne          Ralph Ince
7            $1000 a Touchdown        Delmer Daves      James P. Hogan
8               $50,000 Reward  Frank Howard Clark  Clifford S. Elfelt
9               10,000 Dollars         Frank Lloyd         Frank Lloyd

#### **d. Relação dos 100 títulos mais bem avaliados, suas avaliações e total de votos.**
<a id="ancora4.5"></a>
[voltar](#ancora).

In [8]:
query = '''SELECT 
  nom_titulo, 
  classificacao_media, 
  COUNT(classificacao_media) AS total_votos 
FROM 
  Titulo 
  LEFT JOIN Avaliacao ON Titulo.cod_titulo = Avaliacao.cod_titulo 
GROUP BY 
  nom_titulo 
ORDER BY 
  classificacao_media DESC 
LIMIT 100; 
'''
pd.read_sql(query,con)

,nom_titulo,classificacao_media,total_votos
0,Golod... golod... golod,94,1
1,Milionar pentru o zi,90,1
2,It's a Wise Child,89,1
3,His Glorious Night,88,1
4,Nishizumi senshacho-den,88,1
...,...,...,...
95,Otona no miru ehon - Umarete wa mita keredo,80,1
96,Der Sträfling aus Stambul,80,1
97,Free Eats,80,1
98,Igloo,80,1
99,My Man Godfrey,80,1

### **8.Solução .**
<a id="ancora8"></a>
[voltar](#ancora).

#### **a ‒ Títulos sem avaliação.**
<a id="ancora5.1"></a>
[voltar](#ancora).

In [13]:
query = '''SELECT 
    nom_titulo as "Titulos sem votação"
FROM
    Titulo
        LEFT JOIN
    avaliacao ON titulo.cod_titulo = avaliacao.cod_titulo
WHERE
    avaliacao.qtd_votos < 1;
'''
pd.read_sql(query,con)

Empty DataFrame
Columns: [Titulos sem votação]
Index: []

* **Todos os títulos possuem avaliações.**

#### **b ‒ Títulos sem o detalhe da duração (qtd_minutos) ou informação do gênero (dsc_genero).**
<a id="ancora5.2"></a>
[voltar](#ancora).

In [23]:
query = '''SELECT 
    nom_titulo AS 'Titulos sem duração ou sem informação do genero'
FROM
    titulo
        LEFT JOIN
    titulo_detalhe ON titulo.cod_titulo = titulo_detalhe.cod_titulo
WHERE
    titulo_detalhe.qtd_minutos < 1
        OR dsc_genero IS NULL; 
'''
pd.read_sql(query,con)

        Titulos sem duração ou sem informação do genero
0                                           Un bon bock
1                             Opening of the Kiel Canal
2                                      Awakening of Rip
3                   Barque sortant du port de Trouville
4                            Bateau-mouche sur la Seine
...                                                 ...
4656                                            Kalyani
4657  Miyamoto Musashi - Dai-ichi-bu: Kusawake no hi...
4658                            Peter, Paul und Nanette
4659                                          Sibiryaki
4660                                      Simón Bolívar

[4661 rows x 1 columns]

* **Foram encontrados 4661 registros de titulos sem duração ou sem informações de dsc_genero.**

#### **c - Títulos sem autor;.**
<a id="ancora5.3"></a>
[voltar](#ancora).

In [35]:
query = '''SELECT 
    t.nom_titulo AS "Títulos sem Autor"
FROM
    titulo t
        LEFT JOIN
    autoria aut ON t.cod_titulo = aut.cod_titulo
        LEFT JOIN
    pessoa pes ON aut.cod_pessoa = pes.cod_pessoa
WHERE
    pes.nom_pessoa IS NULL; 
'''
pd.read_sql(query,con)

            Títulos sem Autor
0                  Carmencita
1      Le clown et ses chiens
2              Pauvre Pierrot
3                 Un bon bock
4            Blacksmith Scene
...                       ...
15155          Sued for Libel
15156         Suotorpan tyttö
15157           Susan and God
15158                 Suvorov
15159            Swing Social

[15160 rows x 1 columns]

* **Encontramos 15160 nome de titulos sem autor**.

#### **d - Títulos sem diretor.**
<a id="ancora5.4"></a>
[voltar](#ancora).

In [33]:
query = '''SELECT 
    t.nom_titulo as "titulos sem Diretor"
FROM
    titulo t
        LEFT JOIN
    direcao dir ON t.cod_titulo = dir.cod_titulo
        LEFT JOIN
    pessoa pes ON dir.cod_pessoa = pes.cod_pessoa
WHERE
    pes.nom_pessoa IS NULL;
'''
pd.read_sql(query,con)

                              titulos sem Diretor
0     Corbett and Courtney Before the Kinetograph
1                L'arrivée d'un train à La Ciotat
2                        Italienischer Bauerntanz
3                              Rough Sea at Dover
4            Départ de Jérusalem en chemin de fer
...                                           ...
1849                        Shakespearian Spinach
1850                            Il sogno di tutti
1851                               Spring Meeting
1852                                      Suvorov
1853                                 Swing Social

[1854 rows x 1 columns]

* **Foram encontrados 1854 registros de títulos sem Diretor**.

#### **e - Títulos sem elenco.**
<a id="ancora5.5"></a>
[voltar](#ancora).

In [34]:
query = '''SELECT 
    t.nom_titulo as "titulos sem Elenco"
FROM
    titulo t
        LEFT JOIN
    elenco ON t.cod_titulo = elenco.cod_titulo
        LEFT JOIN
    pessoa pes ON elenco.cod_pessoa = pes.cod_pessoa
WHERE
    pes.nom_pessoa IS NULL;
'''
pd.read_sql(query,con)

                                     titulos sem Elenco
0                                   Branden i Frihavnen
1                                       Fæstningskrigen
2                                 Mellem Aber og Bjørne
3                                     Det løbske gasrør
4     Episódios da Terrível Explosão de Bombas no Porto
...                                                 ...
2384                                    Suotorpan tyttö
2385                                      Susan and God
2386                                            Suvorov
2387                                        Svetlyy put
2388                                       Swing Social

[2389 rows x 1 columns]

* **Forma encontados 2389 registros de títulos sem elenco.**

### **9.Solução .**
<a id="ancora9"></a>
[voltar](#ancora).


* **a. Nome do Título: coluna nom_titulo da tabela Titulo.**
* **b. Tipo do Título: coluna tip_titulo da tabela Titulo_Detalhe (em maiúsculo).**
* **c. Ano de Lançamento: coluna ano_lancamento da tabela Titulo_Detalhe.**
* **d. Duração: coluna qtd_minutos da tabela Titulo_Detalhe (se existir ou não).**
* **e. Gênero(s): coluna dsc_genero da tabela Titulo_Detalhe (se existir ou não).**
* **f. Nota: coluna classificacao_media da tabela Avaliacao (se existir ou não).**
* **g. Autor: nom_pessoa da tabela Pessoa (se existir ou não).**
* **h. Diretor: nom_pessoa da tabela Pessoa (se existir ou não).**

In [37]:
query = '''SELECT 
                Titulo.nom_titulo,
                UPPER(Titulo_Detalhe.tip_titulo) AS tip_titulo,
                Titulo_Detalhe.ano_lancamento,
                Titulo_Detalhe.qtd_minutos,
                Titulo_Detalhe.dsc_genero,
                Avaliacao.classificacao_media,
                P1.nom_pessoa AS autor,
                P2.nom_pessoa AS diretor
            FROM
                Titulo
                    LEFT JOIN
                Titulo_Detalhe ON Titulo.cod_titulo = Titulo_Detalhe.cod_titulo
                    LEFT JOIN
                Avaliacao ON Titulo.cod_titulo = Avaliacao.cod_titulo
                    LEFT JOIN
                Autoria ON Titulo.cod_titulo = Autoria.cod_titulo
                    LEFT JOIN
                Direcao ON Titulo.cod_titulo = Direcao.cod_titulo
                    LEFT JOIN
                Pessoa P1 ON autoria.cod_pessoa = P1.cod_pessoa
                    LEFT JOIN
                Pessoa P2 ON direcao.cod_pessoa = P2.cod_pessoa
            WHERE
                Titulo.ind_status = 'A'
            ORDER BY Titulo.nom_titulo;
'''

pd.read_sql(query,con)

,nom_titulo,tip_titulo,ano_lancamento,qtd_minutos,dsc_genero,classificacao_media,autor,diretor
0,-But the Flesh Is Weak,MOVIE,1932,77,Comedy,57.0,Ivor Novello,Jack Conway
1,"¡Centinela, alerta!",MOVIE,1937,80,Musical,51.0,None,None
2,¡Que viva Mexico!,MOVIE,1932,88,History,NaN,Grigoriy Aleksandrov,None
3,¡Tango!,MOVIE,1933,80,"Musical,Romance",63.0,None,Luis Moglia Barth
4,¿Quién me hará olvidar sin morir?,MOVIE,1916,0,,NaN,None,Mario Caserini
...,...,...,...,...,...,...,...,...
19609,Zwischen Nacht und Morgen,MOVIE,1920,0,,NaN,None,Siegfried Philippi
19610,Zwischen Nacht und Morgen,MOVIE,1931,79,Drama,NaN,None,Gerhard Lamprecht
19611,Zwischen Strom und Steppe,MOVIE,1939,85,,NaN,None,Géza von Bolváry
19612,Zwischen zwei Herzen,MOVIE,1934,0,,NaN,None,Herbert Selpin
19613,Zwölf Minuten nach zwölf,MOVIE,1939,87,"Comedy,Crime",NaN,None,Johannes Guter

###  **10.Solução .**
<a id="ancora10"></a>
[voltar](#ancora).

###  **11.Solução .**
<a id="ancora11"></a>
[voltar](#ancora).

###  **12.Solução .**
<a id="ancora12"></a>
[voltar](#ancora).

###  **13.Solução .**
<a id="ancora13"></a>
[voltar](#ancora).

In [34]:
# Criando a tabela de Pessoa;
Altera='''
ALTER TABLE Pessoa
MODIFY COLUMN nom_pessoa VARCHAR(1000);'''
cursor.execute(Altera)
cursor.execute('desc pessoa')
for i in cursor:
  print(i)

('cod_pessoa', b'int', 'NO', bytearray(b'PRI'), None, '')
('nom_pessoa', b'varchar(1000)', 'YES', bytearray(b''), None, '')
('ano_nascimento', b'int', 'YES', bytearray(b''), None, '')
('ano_falescimento', b'int', 'YES', bytearray(b''), None, '')
('dsc_profissao', b'varchar(1000)', 'YES', bytearray(b''), None, '')

###  **14.Solução .**
<a id="ancora14"></a>
[voltar](#ancora).

###  **15.Solução .**
<a id="ancora15"></a>
[voltar](#ancora).

### **16.Solução .** 
<a id="ancora16"></a>
[voltar](#ancora).

### **17.Solução .**
<a id="ancora17"></a>
[voltar](#ancora).

### **18.Solução .**
<a id="ancora18"></a>
[voltar](#ancora).

###  **19.Solução .**
<a id="ancora19"></a>
[voltar](#ancora).

###  **20.Solução .**
<a id="ancora20"></a>
[voltar](#ancora).

###  **21.Solução .**
<a id="ancora21"></a>
[voltar](#ancora).